#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```terraform

google_compute_managed_ssl_certificate.default: Refreshing state... [id=projects/cloudresume-380001/global/sslCertificates/cloud-resume-cert]
google_storage_bucket.default: Refreshing state... [id=davidbour-cloud-resume]
google_compute_global_address.default: Refreshing state... [id=projects/cloudresume-380001/global/addresses/resume]
google_firebase_project.default: Refreshing state... [id=projects/cloudresume-380001]
google_api_gateway_api.api_cfg: Refreshing state... [id=projects/cloudresume-380001/locations/global/apis/visitor-api-gateway]
google_project_service.firebase_database: Refreshing state... [id=cloudresume-380001/firebasedatabase.googleapis.com]
google_storage_bucket_iam_member.default: Refreshing state... [id=b/davidbour-cloud-resume/roles/storage.objectViewer/allUsers]
google_compute_backend_bucket.default: Refreshing state... [id=projects/cloudresume-380001/global/backendBuckets/cloud-resume-backend-bucket]
google_compute_url_map.default: Refreshing state... [id=projects/cloudresume-380001/global/urlMaps/http-lb]
google_api_gateway_api_config.api_cfg: Refreshing state... [id=projects/cloudresume-380001/locations/global/apis/visitor-api-gateway/configs/visitor-api-gateway-cfg]
google_compute_target_https_proxy.default: Refreshing state... [id=projects/cloudresume-380001/global/targetHttpsProxies/cloud-https-proxy]
google_compute_global_forwarding_rule.default: Refreshing state... [id=projects/cloudresume-380001/global/forwardingRules/https-lb-forwarding-rule]
google_firebase_database_instance.default: Refreshing state... [id=projects/cloudresume-380001/locations/us-central1/instances/cloudresume-380001-default-rtdb]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_api_gateway_gateway.api_gw will be created
  + resource "google_api_gateway_gateway" "api_gw" {
      + api_config       = "projects/cloudresume-380001/locations/global/apis/visitor-api-gateway/configs/visitor-api-gateway-cfg"
      + default_hostname = (known after apply)
      + display_name     = (known after apply)
      + gateway_id       = "visitor-api-gateway"
      + id               = (known after apply)
      + name             = (known after apply)
      + project          = (known after apply)
      + region           = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Warning: Quoted references are deprecated

  on main.tf line 132, in resource "google_api_gateway_gateway" "api_gw":
 132:   provider   = "google-beta"

In this context, references are expected literally rather than in quotes.
Terraform 0.11 and earlier required quotes, but quoted references are now
deprecated and will be removed in a future version of Terraform. Remove the
quotes surrounding this reference to silence this warning.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pushed by: @david-bour, Action: `pull_request`*